; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?drone - drone ?arm - arm ?crate - crate)
    (empty-arm ?drone - drone ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?drone ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (not (empty-arm ?drone ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?drone ?arm ?crate)     
        (content-crate ?content ?crate)          
    )
    :effect (and 
        (not (has-crate-drone-arm ?drone ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?drone ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l12_p12_c12_g12_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(empty-arm drone1 left)
	(empty-arm drone1 right)
	(content-crate food crate1)
	(content-crate medicine crate2)
	(content-crate medicine crate3)
	(content-crate medicine crate4)
	(content-crate medicine crate5)
	(content-crate medicine crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(content-crate medicine crate12)
	(person-at person1 loc4)
	(person-at person2 loc6)
	(person-at person3 loc9)
	(person-at person4 loc5)
	(person-at person5 loc12)
	(person-at person6 loc5)
	(person-at person7 loc7)
	(person-at person8 loc6)
	(person-at person9 loc12)
	(person-at person10 loc6)
	(person-at person11 loc10)
	(person-at person12 loc12)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person2 medicine)
	(has-content-person person3 medicine)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
	(has-content-person person7 medicine)
	(has-content-person person8 medicine)
	(has-content-person person9 medicine)
	(has-content-person person10 medicine)
	(has-content-person person11 medicine)
	(has-content-person person12 medicine)
))
)

; plan
1. (pick-up-crate crate12 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate12 depot)
   added: (has-crate-drone-arm drone1 right crate12)
   goals met: 1 of 13
2. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate1 depot)
   added: (has-crate-drone-arm drone1 left crate1)
   goals met: 1 of 13
3. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 0 of 13
4. (drop-crate loc4 person1 crate1 left food drone1)
   deleted: (has-crate-drone-arm drone1 left crate1)
   added: (has-content-person person1 food) (empty-arm drone1 left)
   goals met: 1 of 13
5. (drone-move loc4 loc10 drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 loc10)
   goals met: 1 of 13
6. (drop-crate loc10 person11 crate12 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate12)
   added: (has-content-person person11 medicine) (empty-arm drone1 right)
   goals met: 2 of 13
7. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 3 of 13
8. (pick-up-crate crate11 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate11 depot)
   added: (has-crate-drone-arm drone1 right crate11)
   goals met: 3 of 13
9. (drone-move depot loc9 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc9)
   goals met: 2 of 13
10. (drop-crate loc9 person3 crate11 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate11)
   added: (has-content-person person3 medicine) (empty-arm drone1 right)
   goals met: 3 of 13
11. (drone-move loc9 depot drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 depot)
   goals met: 4 of 13
12. (pick-up-crate crate10 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate10 depot)
   added: (has-crate-drone-arm drone1 right crate10)
   goals met: 4 of 13
13. (drone-move depot loc7 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc7)
   goals met: 3 of 13
14. (drop-crate loc7 person7 crate10 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate10)
   added: (has-content-person person7 medicine) (empty-arm drone1 right)
   goals met: 4 of 13
15. (drone-move loc7 depot drone1)
   deleted: (drone-at drone1 loc7)
   added: (drone-at drone1 depot)
   goals met: 5 of 13
16. (pick-up-crate crate9 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate9 depot)
   added: (has-crate-drone-arm drone1 right crate9)
   goals met: 5 of 13
17. (pick-up-crate crate8 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate8 depot)
   added: (has-crate-drone-arm drone1 left crate8)
   goals met: 5 of 13
18. (drone-move depot loc12 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc12)
   goals met: 4 of 13
19. (drop-crate loc12 person5 crate8 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate8)
   added: (has-content-person person5 medicine) (empty-arm drone1 left)
   goals met: 5 of 13
20. (drop-crate loc12 person9 crate9 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate9)
   added: (has-content-person person9 medicine) (empty-arm drone1 right)
   goals met: 6 of 13
21. (drone-move loc12 depot drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 depot)
   goals met: 7 of 13
22. (pick-up-crate crate7 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate7 depot)
   added: (has-crate-drone-arm drone1 right crate7)
   goals met: 7 of 13
23. (drone-move depot loc12 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc12)
   goals met: 6 of 13
24. (drop-crate loc12 person12 crate7 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate7)
   added: (has-content-person person12 medicine) (empty-arm drone1 right)
   goals met: 7 of 13
25. (drone-move loc12 depot drone1)
   deleted: (drone-at drone1 loc12)
   added: (drone-at drone1 depot)
   goals met: 8 of 13
26. (pick-up-crate crate6 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate6 depot)
   added: (has-crate-drone-arm drone1 right crate6)
   goals met: 8 of 13
27. (pick-up-crate crate5 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate5 depot)
   added: (has-crate-drone-arm drone1 left crate5)
   goals met: 8 of 13
28. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 7 of 13
29. (drop-crate loc6 person2 crate5 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate5)
   added: (has-content-person person2 medicine) (empty-arm drone1 left)
   goals met: 8 of 13
30. (drop-crate loc6 person8 crate6 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate6)
   added: (has-content-person person8 medicine) (empty-arm drone1 right)
   goals met: 9 of 13
31. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 10 of 13
32. (pick-up-crate crate4 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate4 depot)
   added: (has-crate-drone-arm drone1 right crate4)
   goals met: 10 of 13
33. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 9 of 13
34. (drop-crate loc6 person10 crate4 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate4)
   added: (has-content-person person10 medicine) (empty-arm drone1 right)
   goals met: 10 of 13
35. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 11 of 13
36. (pick-up-crate crate3 depot drone1 right)
   deleted: (empty-arm drone1 right) (crate-at crate3 depot)
   added: (has-crate-drone-arm drone1 right crate3)
   goals met: 11 of 13
37. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm drone1 left) (crate-at crate2 depot)
   added: (has-crate-drone-arm drone1 left crate2)
   goals met: 11 of 13
38. (drone-move depot loc5 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc5)
   goals met: 10 of 13
39. (drop-crate loc5 person4 crate2 left medicine drone1)
   deleted: (has-crate-drone-arm drone1 left crate2)
   added: (has-content-person person4 medicine) (empty-arm drone1 left)
   goals met: 11 of 13
40. (drop-crate loc5 person6 crate3 right medicine drone1)
   deleted: (has-crate-drone-arm drone1 right crate3)
   added: (has-content-person person6 medicine) (empty-arm drone1 right)
   goals met: 12 of 13
41. (drone-move loc5 depot drone1)
   deleted: (drone-at drone1 loc5)
   added: (drone-at drone1 depot)
   goals met: 13 of 13
